
const All = [

    {id: 1,
        name: '하하호호집',
        type: '우도',
        value:"하하호호는 하우목동항 북측에 위치한 간이음식점이다.두툼한 흑돼지 패티위에 우도 땅콩이나 마늘칩이 뿌린 수제버거가 대표적인 메뉴로 성인남자가 배부를 정도인 1.5인분의 양이다. 야채 등의 재료를 아낌없이 넣어 양이 푸짐하여 많은 여행객의 호감을 얻고 있다.",
        url: '/ex/resources/img/food/우도)하하호호.jpg',
        address: '제주특별자치도 제주시 우도면 우도해안길 532'
    },
    {id: 2,
        name: '섬소나이',
        type: '우도',
        value:"우도에 위치한 섬소나이는 짬뽕과 피자를 즐길 수 있는 작고 예쁜 식당이다. 메뉴는 간단하다. 짬뽕 세 종류와 피자 두 종류 총 다섯가지다. 이 집 짬뽕 맛의 비결은 한약재 등 10가지 이상의 재료를 사용하여 12시간 동안 푹 끓여낸 육수에서 나온다. 톳을 사용해 면을 만들고 모자반(몸)을 넣어 우도의 맛을 살렸다. 면은 매일 직접 뽑아내고 당일생산 당일소모를 원칙으로 삼는다. 신선하게 내기 위해 주문을 받은 후 한 그릇씩 조리하니 정성이 이만저만이 아니다. 주문 즉시 한 그릇씩 조리를 하기 때문에 대기시간이 좀 있을 수도 있다.",
        url: '/ex/resources/img/food/우도)섬소나이.jpg',
        address: '제주특별자치도 제주시 우도면 우도해안길 814'
    },
    {id: 3,
        name: '블랑로쉐',
        type: '우도',
        value:"블랑로쉐는 우도 하고수동 해변가에 위치한 카페다. 안에서 파랗게 빛나는 하고수동 해변을 볼 수 있다.날이 좋으면 전면이 창으로된 한쪽 벽을 오픈해 시원한 바닷바람을 만끽하며 휴식을 취할 수 있다.상큼한 에이드와 여러 음료를 파는데 그중에서도 우도땅콩으로 만든 빙수와 크림라떼가 대표메뉴다.땅콩치즈케이크와 제주말차티라미슈 등 지역의 특산품을 녹여낸 다양한 메뉴도 만나볼 수 있다.화이트 톤의 실내와 테라스 등의 전경이 예뻐 사진찍기 좋은 곳으로도 알려졌다.",
        url: '/ex/resources/img/food/우도)블랑로쉐.jpg',
        address: '제주특별자치도 제주시 우도면 우도해안길 783'
    },
    {id: 1,
        name: '리치망고',
        type: '애월',
        value:"제주 애월에서 런칭한 리치망고는 프렌차이즈로 현재 우도, 모슬포 성산 등 제주전역으로 확장하였다.",
        url: '/ex/resources/img/food/리치망고.jpg',
        address: "제주특별자치도 제주시 애월읍 애월해안로 272"
    },
    {id: 2,
        name: '봄날카페',
        type: '애월',
        value:"봄날카페는 드라마의 주인공이 일하던 카페라서 유명해졌다.해변을 바라보며 차 한잔의 여유를 즐기기에 좋으며 제주 돌담의 정취를 느낄 수 있다.",
        url: '/ex/resources/img/food/애월)봄날.jpg',
        address: "제주특별자치도 제주시 애월읍 애월로1길 25"
    },
    {id: 3,
        name: '바다속 고등어쌈밥',
        type: '애월',
        value:"공항에서 애월 해안도로로 15분쯤 달리다 보면 도로변에 위치한 바다속고등어쌈밥을 발견할 수 있다.이곳은 고등어 요리 전문점이지만 갈치조림이나 옥돔구이, 해물뚝배기, 한치물회 등 여러 해산물 요리를 같이 판매하고 있다.대표 메뉴 쌈밥은 묵은지를 넣은 고등어조림으로, 고등어와 묵은지를 채소에 싸먹는 요리이다.",
        url: '/ex/resources/img/food/바다속 고등어쌈밥.jpg',
        address: "제주특별자치도 제주시 애월읍 애월해안로 7089"
    },
    {id: 1,
        name: '최고집',
        type: '서귀포시',
        value:"애월 에서 유명한 최고집은 1등급 이상의 제주 백돼지를 맛볼 수 있는 곳으로, 항정살과 오겹살에만 집중하여 최고의 맛을 선보인다. 오후 6시경부터는 대기자가 발생할 수 있으니 그 전에 방문하거나 예약하는 것이 좋은데, 예약은 7시까지만 받는다. (8시 방문건은 예약 불가)",
        url: '/ex/resources/img/food/최고집.jpg',
        address:'제주특별자치도 서귀포시 김정문화로 71'
    },
    {id: 2,
        name: '테라로사',
        type: '서귀포시',
        value:"품격있는 커피와 빵으로 유명한 테라로사의 서귀포 지점.유명한 관광지인 쇠소깍 바로 옆에 위치하고 있다.카페가 있을 것 같지 않은 곳에 자리하고 있다는 점도 신선하지만,채광이 좋고 탁 트인 공간의 인테리어가 주는 여유로움과 편안함에 많은 여행객들이 찾는다",
        url: '/ex/resources/img/food/서귀)테라로사.jpg',
        address:'제주특별자치도 서귀포시 칠십리로658번길 27-16'
    },
    {id: 3,
        name: '국수바다',
        type: '서귀포시',
        value:"볼거리가 많은 서귀포 중문에는 고기국수로 유명한 국수바다가 있다. 유명 맛집 프로그램에 나온 후 많은 사람들이 찾는 곳으로 넓은 주차장과 테이블이 있어 대기시간이 그리 길지 않다. 이곳의 고기국수는 직접 반죽하고 뽑아낸 생면과 12시간 이상 푹 고아 낸 육수, 제주산 최고급 오겹살이 푸짐하게 들어가 있어 대식가도 배불리 먹을 수 있다. 또한 매콤하고 새콤한 소스가 일품인 비빔국수도 인기있는 메뉴로, 고기국수의 국물과 같이 먹으면 더욱 감칠맛이 난다. ",
        url: '/ex/resources/img/food/서귀)국수바다.jpg',
        address:'제주특별자치도 서귀포시 일주서로 982'
    },
    {
    id: 1,
        name: '고집돌우럭',
        type: '중문',
        value:"고집돌우럭은 제주공항점과 중문점이 있는데 중문점은 더욱 깔끔하고 세련된 인테리어로 손님을 맞으며 중문관광단지 입구에 위치하여 가까운 관광지 방문시 이동이 편리하다. 고집돌우럭은 주낙배를 직접 운영하여 싱싱한 돌우럭을 공급하며 위미리 어촌계와 독점계약을 맺어 가장 신선한 해산물을 공급 받고 있다.아침식사가 가능해서 숙소가 근처라면 여행길에 오르기 전 이곳에서 든든하게 속부터 채우는 것도 나쁘지 않다.",
        url: '/ex/resources/img/food/중문)고집돌우럭.jpg',
        address:'제주특별자치도 서귀포시 일주서로 879'
    },
    {id: 2,
        name: '수두리보말칼국수',
        type: '중문',
        value:"직접 반죽한 톳면에 매일 아침마다 준비하는 자연산 보말이 100% 들어간 육수만 사용한다. 반찬 또한 직접 손질하고 만들어 제공받을 수 있다. 톳으로 만든 쫄깃쫄깃한 면과 담백하지만 시원한 국물맛이 일품인 수두리보말칼국수(톳보말칼국수), 톳성게칼국수, 성게전복죽이 대표메뉴이다.  8시부터 영업을 하기 때문에 아침식사하기 좋다.",
        url: '/ex/resources/img/food/중문)수두리보말칼국수.jpg',
        address:'제주특별자치도 서귀포시 천제연로 192'
    },
    {id: 3,
        name: '옐로우카페',
        type: '중문',
        value:"장수 제품의 이미지를 벗고 새로운 변신으로 우리 곁에 친근하게 다가온 옐로우카페.입구에 도착하면 바나나맛우유의 대형 조형물이 우리를 반겨주고 있으며카페에 들어서면 온통 노란색으로 꾸며져 있는 인테리어가 눈길을 끈다.               2030 세대는 물론 어린아이들의 시선까지 한 몸에 받고 있는 옐로우카페.",
        url: '/ex/resources/img/food/중문)옐로우카페.jpg',
        address:'제주 서귀포시 중문관광로 90'
    },
    {id: 1,
        name: '제주 김만복(김밥집)',
        type: '제주시내',
        value:"제주 김만복은 제주공항과 가까운 전복김밥이 유명한 분식집이다. 본점은 포장만 가능하며 본점에서 멀지 않은 곳에 앉아서 즐길 수 있는 라운지점이 있다. 강정동에 오픈하여 서귀포에서도 방문할 수 있다. 전복김밥은 전복내장을 잘 섞은 밥과 계란지단이 만나 고소하고 달콤한 맛이 특징이다. 전복김밥 이외에도 전복이 통째로 올라간 통전복주먹밥과 미역국 등이 있으며 새콤달콤하게 무쳐낸 오징어 무침과 함께 먹으면 잘 어울린다. 비교적 착한 가격으로 전복김밥을 먹을 수 있다는 점과 전복내장이 주는 고소한 맛의 조화로 많은 관광객의 사랑을 받고 있다.",
        url: '/ex/resources/img/food/제주시내)제주김만복.jpg',
        address:'제주특별자치도 제주시 오라로 41'
    },
    {id: 2,
        name: '올래국수 ',
        type: '제주시내',
        value:"올래국수 이 집의 메뉴는 단 하나. 두툼한 고기와 도톰한 중면이 구수한 사골국물과 어우러져 고소하고 구수한 맛을 자랑하는 고기 국수다. 맛은 한국의 설렁탕보다는 진하고 일본의 돈코츠 라멘보다는담백하다. 고소하고 깊은 맛이 입소문을 타서 tvN 수요미식회 등 각종 방송에 출연하기도 하였다. (21회 2015.06.17) ",
        url: '/ex/resources/img/food/제주시내)올래국수.jpg',
        address:'제주특별자치도 제주시 귀아랑길 24 (연동)'
    },
    {id: 2,
        name: '명당약과  ',
        type: '제주시내',
        value:"명당약과는 1980년부터 시작한 제주 토종 브랜드이며 2대째 대를 이어 운영을 하고 있다.유기농 밀가루와 천연발효종을 이용한 빵과 국내산 쌀가루로 만든 쌀빵부터 직접 끓인 팥을 사용하여 팥빵과빙수에 사용하고 있으며,그 외에 제주산 마늘을 사용한 마늘 바게트 등 오래된 빵부터 트랜디한 빵과 디저트까지 다양한 제품이 준비되어 있다. ",
        url: '/ex/resources/img/food/제주도시)명당약과.jpg',
        address:'제주시 원노형로 83'
    },

];

function showList(val=''){
    list.innerHTML='';
    const res = All.forEach(All =>{
        if(All.value.includes(val)){
        const li=document.createElement('li');  
        li.innerHTML=`
        <img src='${All.url}' alt=${All.value}>
        <p>가게이름: ${All.name}</p>
        <p>지역: ${All.type}</p>
        <p>설명: ${All.value}</p>
        <p>주소: ${All.address}</p>
        `
        list.appendChild(li);
         
      }
    })
}

const searchInput=document.getElementById('search');
const searchBtn=document.getElementById('searchBtn');

searchBtn.addEventListener('click',(e) =>{
    e.preventDefault();
    const val=searchInput.value;
    console.log(val);
    showList(val);
})





